In [1]:
import pandas as pd
import mysql.connector as connection

In [2]:
sql = "SELECT * FROM classicmodels.orders;"

In [3]:
db = connection.connect(host='localhost', database='classicmodels', user='root', passwd='demopass01', use_pure=True)

In [4]:
df = pd.read_sql(sql, db)

C:\Users\asus\AppData\Local\Temp\ipykernel_12380\3349604202.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, db)

In [5]:
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,None,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,None,141

In [6]:
df.to_excel("mysql_date.xlsx", index=False)

In [10]:
sql_customer = "SELECT * FROM classicmodels.customers WHERE country = 'France';"

In [11]:
df_customer = pd.read_sql(sql_customer, db)

C:\Users\asus\AppData\Local\Temp\ipykernel_12380\1622091835.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_customer = pd.read_sql(sql_customer, db)

In [12]:
df_customer.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370,21000.0
1,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370,118200.0
2,146,"Saveley & Henriot, Co.",Saveley,Mary,78.32.5555,"2, rue du Commerce",None,Lyon,None,69004,France,1337,123900.0
3,171,Daedalus Designs Imports,Rancé,Martine,20.16.1555,"184, chaussée de Tournai",None,Lille,None,59000,France,1370,82900.0
4,172,"La Corne D'abondance, Co.",Bertrand,Marie,(1) 42.34.2555,"265, boulevard Charonne",None,Paris,None,75012,France,1337,84300.0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 326 entries, 0 to 325
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   orderNumber     326 non-null    int64
 1   orderDate       326 non-null    object
 2   requiredDate    326 non-null    object
 3   shippedDate     312 non-null    object
 4   status          326 non-null    object
 5   comments        80 non-null     object
 6   customerNumber  326 non-null    int64
dtypes: int64(2), object(5)
memory usage: 18.0+ KB

In [14]:
df.describe()

        orderNumber  customerNumber
count    326.000000      326.000000
mean   10262.500000      263.834356
std       94.252321      121.325792
min    10100.000000      103.000000
25%    10181.250000      145.250000
50%    10262.500000      240.000000
75%    10343.750000      360.750000
max    10425.000000      496.000000